app/Controllers/Categorias.php

  public function index($activo=1){
    $categorias=$this->categorias->where('activo', $activo)->findAll();
---
SELECT *
FROM `categorias`
WHERE `activo` = 1
AND `categorias`.`deleted_at` IS NULL

  public function eliminados($activo=0){
    $categorias=$this->categorias->where('activo', $activo)->findAll();
---
SELECT *
FROM `categorias`
WHERE `activo` = 0
AND `categorias`.`deleted_at` IS NULL

  public function reinsertar($id){
    $this->categorias->update($id, ['activo'=>1]);
---
UPDATE `categorias` SET `activo` = 1, `fecha_edit` = '2023-07-24 13:39:00'
WHERE `categorias`.`id` IN ('2')