app/Controllers/ComprasTemporalController.php

SELECT *
FROM `productos`
WHERE `id` = '9'
AND `productos`.`deleted_at` IS NULL
 LIMIT 1
---
  public function insertar($id_producto, $cantidad, $id_compra){
    $error='';
    $producto=$this->productos->where('id', $id_producto)->first();