app/Controllers/ComprasController.php

  public function index($activo=1){
    $compras=$this->compras->where('activo', $activo)->findAll();
---
SELECT *
FROM `compras`
WHERE `activo` = 1

  public function guardar(){
    $id_compra=$this->request->getPost('id_compra');
    $total=preg_replace('/[\$,]/', '', $this->request->getPost('total'));
    $session=session();
    $resultado_id=$this->compras->insertarCompra($id_compra, $total, $session->id_usuario);

    if($resultado_id){
      $this->compras_temporal=new ComprasTemporalModel();
      $resultadoCompra=$this->compras_temporal->porCompra($id_compra);
      foreach($resultadoCompra as $row){
        $this->detalle_compra->save([
          'id_compra'=>$resultado_id,
          'id_producto'=>$row['id_producto'],
          'nombre'=>$row['nombre'],
          'cantidad'=>$row['cantidad'],
          'precio'=>$row['precio']
        ]);
---
INSERT INTO `detalle_compra` (`id_compra`, `id_producto`, `nombre`, `cantidad`, `precio`, `fecha_alta`, `fecha_edit`) VALUES (3, '7', 'El Señor de los Anillos - La comunidad del anillo', '1', '14', '2023-08-10 17:52:52', '2023-08-10 17:52:52')

  function generaCompraPdf($id_compra){
    $datosCompra=$this->compras->where('id', $id_compra)->first();
    $this->detalle_compra->select('*');
    $this->detalle_compra->where('id_compra', $id_compra);
    $detalleCompra=$this->detalle_compra->findAll();
    $this->configuracion->select('valor');
    $this->configuracion->where('nombre', 'tienda_nombre');
    $nombreTienda=$this->configuracion->get()->getRow()->valor;
    $this->configuracion->select('valor');
    $this->configuracion->where('nombre', 'tienda_direccion');
    $direccionTienda=$this->configuracion->get()->getRow()->valor;
---
SELECT *
FROM `compras`
WHERE `id` = '2'
 LIMIT 1
SELECT *
FROM `detalle_compra`
WHERE `id_compra` = '2'
SELECT `valor`
FROM `configuracion`
WHERE `nombre` = 'tienda_nombre'
SELECT `valor`
FROM `configuracion`
WHERE `nombre` = 'tienda_direccion'