app/Controllers/Productos.php

SELECT *
FROM `productos`
WHERE `activo` = 1
AND `productos`.`deleted_at` IS NULL
---
  public function index($activo=1){
    $productos=$this->productos->where('activo', $activo)->findAll();

SELECT *
FROM `unidades`
WHERE `activo` = 1
AND `unidades`.`deleted_at` IS NULL
SELECT *
FROM `categorias`
WHERE `activo` = 1
AND `categorias`.`deleted_at` IS NULL
---
  public function nuevo(){
    $unidades=$this->unidades->where('activo', 1)->findAll();
    $categorias=$this->categorias->where('activo', 1)->findAll();

SELECT *
FROM `productos`
WHERE `codigo` = '1'
AND `activo` = 1
---
  public function buscar_por_codigo($codigo){
    $res['existe']=false;
    $res['datos']='';
    $res['error']='';
    $this->productos->select('*');
    $this->productos->where('codigo', $codigo);
    $this->productos->where('activo', 1);
    $datos=$this->productos->get()->getRow();