app/Controllers/Unidades.php

SELECT *
FROM `unidades`
WHERE `activo` = 1
AND `unidades`.`deleted_at` IS NULL
---
  public function index($activo=1){
    $unidades=$this->unidades->where('activo', $activo)->findAll();

SELECT *
FROM `unidades`
WHERE `activo` = 0
AND `unidades`.`deleted_at` IS NULL
---
  public function eliminados($activo=0){
    $unidades=$this->unidades->where('activo', $activo)->findAll();