app/Controllers/UsuariosController.php

  public function index($activo=1){
    $usuarios=$this->usuarios->where('activo', $activo)->findAll();
---
SELECT *
FROM `usuarios`
WHERE `activo` = 1
AND `usuarios`.`deleted_at` IS NULL

  public function cambiar_pass(){
    $session=session();
    $usuario=$this->usuarios->where('id', $session->id_usuario)->first();
---
SELECT *
FROM `usuarios`
WHERE `id` = '2'
AND `usuarios`.`deleted_at` IS NULL
 LIMIT 1