app/Models/ComprasModel.php

INSERT INTO `compras` (`total`, `id_usuario`, `fecha_alta`, `fecha_edit`) VALUES ('42.00', '2', '2023-08-10 17:52:52', '2023-08-10 17:52:52')
---
	public function insertarCompra($id_compra, $total, $id_usuario){
		$this->insert([
      'codigo'=>$id_compra,
      'total'=>$total,
      'id_usuario'=>$id_usuario
    ]);
		return $this->insertID();