app/Models/ProductosModel.php

UPDATE `productos` SET `existencias` = existencias + 1, `fecha_edit` = '2023-08-10 17:52:52'
WHERE `id` = '7'
---
	public function actualizarStock($id_producto, $cantidad, $operador='+'){
		$this->set('existencias', "existencias $operador $cantidad", FALSE);//el false es para que ejecute existencias+$cantidad, sino lo guardaria como una cadena sin ejecutar
		$this->where('id', $id_producto);
		$this->update();